<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="1,31" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="/Cast_output_0,input">
					<dim>1</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Concat_137" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="0" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="/features_extractor/flatten/Flatten" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>31</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/features_extractor/flatten/Flatten_output_0">
					<dim>1</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="policy.mlp_extractor.policy_net.0.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 31" offset="16" size="3968" />
			<output>
				<port id="0" precision="FP16" names="policy.mlp_extractor.policy_net.0.weight">
					<dim>64</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="policy.mlp_extractor.policy_net.0.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>31</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="/policy_net/policy_net.0/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>31</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>31</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_1591_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64" offset="3984" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_1591" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/policy_net/policy_net.0/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/policy_net/policy_net.0/Gemm_output_0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/policy_net/policy_net.1/Tanh" type="Tanh" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/policy_net/policy_net.1/Tanh_output_0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="policy.mlp_extractor.policy_net.2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64" offset="4112" size="8192" />
			<output>
				<port id="0" precision="FP16" names="policy.mlp_extractor.policy_net.2.weight">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="policy.mlp_extractor.policy_net.2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/policy_net/policy_net.2/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_1592_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64" offset="12304" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_1592" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/policy_net/policy_net.2/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/policy_net/policy_net.2/Gemm_output_0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/policy_net/policy_net.3/Tanh" type="Tanh" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/policy_net/policy_net.3/Tanh_output_0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="policy.action_net.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="21, 64" offset="12432" size="2688" />
			<output>
				<port id="0" precision="FP16" names="policy.action_net.weight">
					<dim>21</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="policy.action_net.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>21</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>21</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/action_net/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>21</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_1593_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 21" offset="15120" size="42" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_1593" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/action_net/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Add_output_0,/action_net/Gemm_output_0">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_1594_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 21" offset="15162" size="42" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_1594" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Maximum_1364" type="Maximum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_1595_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 21" offset="15204" size="42" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_1595" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Minimum_1436" type="Minimum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="ShapeOf_1437" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="ShapeOf_1365" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/Mul_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 21" offset="15246" size="42" />
			<output>
				<port id="0" precision="FP16" names="/Mul_output_0">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/Mul" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Add_1_output_0">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/Shape_1_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Maximum_1366" type="Maximum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Maximum_1438" type="Maximum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="output" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="output">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="output/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1" />
		<edge from-layer="2" from-port="2" to-layer="5" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="4" to-port="0" />
		<edge from-layer="4" from-port="1" to-layer="5" to-port="1" />
		<edge from-layer="5" from-port="2" to-layer="8" to-port="0" />
		<edge from-layer="6" from-port="0" to-layer="7" to-port="0" />
		<edge from-layer="7" from-port="1" to-layer="8" to-port="1" />
		<edge from-layer="8" from-port="2" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="12" to-port="0" />
		<edge from-layer="10" from-port="0" to-layer="11" to-port="0" />
		<edge from-layer="11" from-port="1" to-layer="12" to-port="1" />
		<edge from-layer="12" from-port="2" to-layer="15" to-port="0" />
		<edge from-layer="13" from-port="0" to-layer="14" to-port="0" />
		<edge from-layer="14" from-port="1" to-layer="15" to-port="1" />
		<edge from-layer="15" from-port="2" to-layer="16" to-port="0" />
		<edge from-layer="16" from-port="1" to-layer="19" to-port="0" />
		<edge from-layer="17" from-port="0" to-layer="18" to-port="0" />
		<edge from-layer="18" from-port="1" to-layer="19" to-port="1" />
		<edge from-layer="19" from-port="2" to-layer="22" to-port="0" />
		<edge from-layer="20" from-port="0" to-layer="21" to-port="0" />
		<edge from-layer="21" from-port="1" to-layer="22" to-port="1" />
		<edge from-layer="22" from-port="2" to-layer="25" to-port="0" />
		<edge from-layer="22" from-port="2" to-layer="33" to-port="0" />
		<edge from-layer="23" from-port="0" to-layer="24" to-port="0" />
		<edge from-layer="24" from-port="1" to-layer="25" to-port="1" />
		<edge from-layer="25" from-port="2" to-layer="28" to-port="0" />
		<edge from-layer="25" from-port="2" to-layer="30" to-port="0" />
		<edge from-layer="26" from-port="0" to-layer="27" to-port="0" />
		<edge from-layer="27" from-port="1" to-layer="28" to-port="1" />
		<edge from-layer="28" from-port="2" to-layer="29" to-port="0" />
		<edge from-layer="28" from-port="2" to-layer="37" to-port="0" />
		<edge from-layer="29" from-port="1" to-layer="36" to-port="0" />
		<edge from-layer="30" from-port="1" to-layer="35" to-port="0" />
		<edge from-layer="31" from-port="0" to-layer="32" to-port="0" />
		<edge from-layer="32" from-port="1" to-layer="33" to-port="1" />
		<edge from-layer="33" from-port="2" to-layer="34" to-port="0" />
		<edge from-layer="34" from-port="1" to-layer="35" to-port="1" />
		<edge from-layer="35" from-port="2" to-layer="36" to-port="1" />
		<edge from-layer="36" from-port="2" to-layer="37" to-port="1" />
		<edge from-layer="37" from-port="2" to-layer="38" to-port="0" />
	</edges>
	<rt_info>
		<Runtime_version value="2024.1.0-15008-f4afc983258-releases/2024/1" />
		<conversion_parameters>
			<input_model value="DIR/robust-dust-41-model.onnx" />
			<is_python_object value="False" />
		</conversion_parameters>
	</rt_info>
</net>
